[
  {
    "name": "Algeria",
    "flag": "https://flagcdn.com/w320/dz.png",
    "description": "Algeria, Africa's largest country, is a mesmerizing blend of Sahara dunes, Mediterranean coastlines, and ancient Roman ruins like Timgad. Its vibrant culture fuses Berber, Arab, and French influences, seen in flavorful cuisine (think couscous and mint tea) and the whitewashed architecture of Algiers' Casbah. As an energy powerhouse with vast oil and gas reserves, Algeria invests in modern infrastructure while preserving its nomadic Tuareg traditions. The Ahaggar Mountains and Tassili n'Ajjer's rock art showcase its dramatic landscapes and 10,000 years of human history.",
    "image": "",
    "gallery": [],
    "details": {
      "Capital": "Algiers",
      "Population": "44 million",
      "GDP": "$193.6 billion",
      "Currency": "Algerian dinar (DZD)",
      "Language": "Arabic, Berber",
      "Calling Code": "+213",
      "Independence": "1962",
      "President": "Abdelmadjid Tebboune",
      "Area": "2,381,741 km²",
      "Continent": "Africa",
      "Timezone": "CET",
      "Religion": "Islam"
    }
  },
  {
    "name": "Angola",
    "flag": "https://flagcdn.com/w320/ao.png",
    "description": "Angola dazzles with its contrasting landscapes, from the Atlantic beaches of Luanda to the lush Okavango Delta borderlands. After overcoming civil war, it's now Africa's second-largest oil producer, fueling rapid urban development. The country's Portuguese heritage shines in its music (like kizomba), colorful colonial buildings, and spicy cuisine featuring funge and moamba. Kissama National Park's wildlife rebounds post-war, while the Tundavala Gap's cliffs offer breathtaking views. Angolans are known for their warmth and entrepreneurial spirit, rebuilding their nation with creativity and hope.",
    "image": "",
    "gallery": [],
    "details": {
      "Capital": "Luanda",
      "Population": "33 million",
      "GDP": "$124.8 billion",
      "Currency": "Kwanza (AOA)",
      "Language": "Portuguese",
      "Calling Code": "+244",
      "Independence": "1975",
      "President": "João Lourenço",
      "Area": "1,246,700 km²",
      "Continent": "Africa",
      "Timezone": "WAT",
      "Religion": "Christianity"
    }
  },
  {
    "name": "Benin",
    "flag": "https://flagcdn.com/w320/bj.png",
    "description": "Benin, the birthplace of Vodun (Voodoo), is a cultural treasure where vibrant traditions thrive. From the stilt villages of Ganvié to the royal palaces of Abomey, its history as the Dahomey Kingdom lives on in festivals and storytelling. Cotton and cashews drive the economy, while ecotourism grows around Pendjari National Park's elephants. Cotonou's bustling Dantokpa Market and Ouidah's Python Temple showcase Benin's blend of spirituality and commerce. The country invests in education and gender equality, with women leading in politics and arts like the famous singer Angélique Kidjo.",
    "image": "",
    "gallery": [],
    "details": {
      "Capital": "Porto-Novo",
      "Population": "12 million",
      "GDP": "$17.4 billion",
      "Currency": "West African CFA franc (XOF)",
      "Language": "French",
      "Calling Code": "+229",
      "Independence": "1960",
      "President": "Patrice Talon",
      "Area": "114,763 km²",
      "Continent": "Africa",
      "Timezone": "WAT",
      "Religion": "Christianity, Islam, Vodun"
    }
  },
  {
    "name": "Botswana",
    "flag": "https://flagcdn.com/w320/bw.png",
    "description": "Botswana is an African success story, combining diamond-driven prosperity with unparalleled wildlife conservation. The Okavango Delta's labyrinthine waterways host lions, hippos, and rare birds, while the Kalahari's San people share ancient survival wisdom. With one of Africa's most stable democracies, Botswana invests in education and healthcare, boasting a growing middle class. Luxury safari lodges coexist with community-run tourism projects, ensuring benefits reach rural areas. From the otherworldly Makgadikgadi salt pans to the rhythmic dance of the Basarwa, Botswana offers authenticity and innovation in harmony.",
    "image": "",
    "gallery": [],
    "details": {
      "Capital": "Gaborone",
      "Population": "2.4 million",
      "GDP": "$18.3 billion",
      "Currency": "Pula (BWP)",
      "Language": "English, Setswana",
      "Calling Code": "+267",
      "Independence": "1966",
      "President": "Mokgweetsi Masisi",
      "Area": "581,730 km²",
      "Continent": "Africa",
      "Timezone": "CAT",
      "Religion": "Christianity"
    }
  },
  {
    "name": "Burkina Faso",
    "flag": "https://flagcdn.com/w320/bf.png",
    "description": "Burkina Faso, the 'Land of Honest People,' shines with artistic energy and resilience. Despite semi-arid climates, its farmers innovate with sustainable techniques, while gold mining boosts the economy. Ouagadougou hosts FESPACO, Africa's largest film festival, celebrating storytelling that crosses borders. The country's mossi masks and balafon music inspire global artists, and women lead in weaving cooperatives. Recent challenges haven't dimmed Burkinabè pride in their communal spirit, seen in lively markets and the sacred crocodiles of Bazoulé who coexist peacefully with villagers.",
    "image": "",
    "gallery": [],
    "details": {
      "Capital": "Ouagadougou",
      "Population": "22 million",
      "GDP": "$19.7 billion",
      "Currency": "West African CFA franc (XOF)",
      "Language": "French",
      "Calling Code": "+226",
      "Independence": "1960",
      "President": "Ibrahim Traoré",
      "Area": "274,222 km²",
      "Continent": "Africa",
      "Timezone": "GMT",
      "Religion": "Islam, Christianity"
    }
  },
  {
    "name": "Burundi",
    "flag": "https://flagcdn.com/w320/bi.png",
    "description": "Burundi's rolling hills and Lake Tanganyika shores hide untapped potential. Known for drumming traditions recognized by UNESCO, the country is rebuilding after conflict, with coffee and tea exports fueling recovery. The Kibira National Park's rainforests shelter chimpanzees, while the Source of the Nile near Rutovu draws visitors. Burundians celebrate their pastoral heritage through Intore dancing and cattle ceremonies. With a young population and fertile land, grassroots initiatives in eco-farming and women's empowerment are sowing seeds for a peaceful future.",
    "image": "",
    "gallery": [],
    "details": {
      "Capital": "Gitega",
      "Population": "12 million",
      "GDP": "$3.4 billion",
      "Currency": "Burundian franc (BIF)",
      "Language": "Kirundi, French",
      "Calling Code": "+257",
      "Independence": "1962",
      "President": "Évariste Ndayishimiye",
      "Area": "27,834 km²",
      "Continent": "Africa",
      "Timezone": "CAT",
      "Religion": "Christianity"
    }
  },
  {
    "name": "Cabo Verde",
    "flag": "https://flagcdn.com/w320/cv.png",
    "description": "Cabo Verde's volcanic islands float like emeralds in the Atlantic, blending African rhythms with Portuguese charm. The birthplace of morna music (made famous by Cesária Évora), its Creole culture thrives in colorful festivals like Mindelo's Carnival. Renewable energy projects harness wind and sun, while eco-tourism highlights pristine beaches and hiking trails on Santo Antão. Once a hub for transatlantic trade, today it's a model of democracy and stability, with diaspora communities worldwide keeping traditions alive through batuko dance and cachupa stew.",
    "image": "",
    "gallery": [],
    "details": {
      "Capital": "Praia",
      "Population": "560,000",
      "GDP": "$2.2 billion",
      "Currency": "Cape Verdean escudo (CVE)",
      "Language": "Portuguese",
      "Calling Code": "+238",
      "Independence": "1975",
      "President": "José Maria Neves",
      "Area": "4,033 km²",
      "Continent": "Africa",
      "Timezone": "CVT",
      "Religion": "Christianity"
    }
  },
  {
    "name": "Cameroon",
    "flag": "https://flagcdn.com/w320/cm.png",
    "description": "Cameroon's nickname 'Africa in Miniature' reflects its staggering diversity: from Douala's bustling ports to the Waza National Park's lions, and from the Francophone jazz clubs to the Anglophone tea fields of Buea. Mount Cameroon, Central Africa's highest peak, lures climbers, while the Bamileke kingdoms preserve elaborate beadwork traditions. As an agricultural powerhouse (cocoa, coffee), it's investing in tech hubs and women-led startups. Football unites the nation, with the Indomitable Lions team sparking nationwide celebrations.",
    "image": "",
    "gallery": [],
    "details": {
      "Capital": "Yaoundé",
      "Population": "27 million",
      "GDP": "$45.2 billion",
      "Currency": "Central African CFA franc (XAF)",
      "Language": "French, English",
      "Calling Code": "+237",
      "Independence": "1960",
      "President": "Paul Biya",
      "Area": "475,442 km²",
      "Continent": "Africa",
      "Timezone": "WAT",
      "Religion": "Christianity, Islam"
    }
  },
  {
    "name": "Central African Republic",
    "flag": "https://flagcdn.com/w320/cf.png",
    "description": "The Central African Republic (CAR) is a hidden gem of biodiversity and cultural wealth. The Dzanga-Sangha Reserve's forest elephants and western lowland gorillas attract researchers, while the Boali Waterfalls showcase natural beauty. Despite challenges, communities preserve traditions like the polyphonic pygmy music recognized by UNESCO. With diamonds and gold underpinning its economy, CAR is gradually rebuilding, supported by peacekeeping efforts and local initiatives promoting dialogue through art and sports.",
    "image": "",
    "gallery": [],
    "details": {
      "Capital": "Bangui",
      "Population": "5 million",
      "GDP": "$2.5 billion",
      "Currency": "Central African CFA franc (XAF)",
      "Language": "French, Sango",
      "Calling Code": "+236",
      "Independence": "1960",
      "President": "Faustin-Archange Touadéra",
      "Area": "622,984 km²",
      "Continent": "Africa",
      "Timezone": "WAT",
      "Religion": "Christianity"
    }
  },
  {
    "name": "Chad",
    "flag": "https://flagcdn.com/w320/td.png",
    "description": "Chad's sweeping Sahelian landscapes tell stories of ancient empires like Kanem-Bornu. Lake Chad, though shrinking, remains a lifeline for fishermen and herders, while the Ennedi Plateau's rock arches inspire awe. Oil revenues fund new roads and schools, and the Zakouma National Park's elephant herds rebound thanks to anti-poaching efforts. The capital N'Djamena buzzes with vibrant markets selling spices and camel leather goods, reflecting Arab and Sub-Saharan cultural fusion.",
    "image": "",
    "gallery": [],
    "details": {
      "Capital": "N'Djamena",
      "Population": "16 million",
      "GDP": "$12.7 billion",
      "Currency": "Central African CFA franc (XAF)",
      "Language": "French, Arabic",
      "Calling Code": "+235",
      "Independence": "1960",
      "President": "Mahamat Déby",
      "Area": "1,284,000 km²",
      "Continent": "Africa",
      "Timezone": "WAT",
      "Religion": "Islam, Christianity"
    }
  },

    {
      "name": "Chad",
      "flag": "https://flagcdn.com/w320/td.png",
      "description": "Chad's sweeping Sahelian landscapes tell stories of ancient empires like Kanem-Bornu. Lake Chad, though shrinking, remains a lifeline for fishermen and herders, while the Ennedi Plateau's rock arches inspire awe. Oil revenues fund new roads and schools, and the Zakouma National Park's elephant herds rebound thanks to anti-poaching efforts. The capital N'Djamena buzzes with vibrant markets selling spices and camel leather goods, reflecting Arab and Sub-Saharan cultural fusion. Chadians are renowned for their endurance and hospitality, preserving nomadic traditions while embracing modern education and technology.",
      "image": "",
      "gallery": [],
      "details": {
        "Capital": "N'Djamena",
        "Population": "16 million",
        "GDP": "$12.7 billion",
        "Currency": "Central African CFA franc (XAF)",
        "Language": "French, Arabic",
        "Calling Code": "+235",
        "Independence": "1960",
        "President": "Mahamat Déby",
        "Area": "1,284,000 km²",
        "Continent": "Africa",
        "Timezone": "WAT",
        "Religion": "Islam, Christianity"
      }
    },
    {
      "name": "Comoros",
      "flag": "https://flagcdn.com/w320/km.png",
      "description": "The Comoros Islands are a fragrant paradise in the Indian Ocean, where vanilla, ylang-ylang, and cloves perfume the air. Known as the 'Perfume Isles,' this volcanic archipelago boasts coral reefs teeming with marine life and black-sand beaches. Comorian culture blends Swahili, Arab, and French influences, seen in grand wedding ceremonies with intricate henna designs and the rhythmic beats of twarab music. Despite political challenges, communities thrive through sustainable fishing and eco-tourism initiatives. The capital Moroni's medina and the active Karthala volcano showcase the islands' dramatic beauty and resilience.",
      "image": "",
      "gallery": [],
      "details": {
        "Capital": "Moroni",
        "Population": "870,000",
        "GDP": "$1.3 billion",
        "Currency": "Comorian franc (KMF)",
        "Language": "Comorian, French, Arabic",
        "Calling Code": "+269",
        "Independence": "1975",
        "President": "Azali Assoumani",
        "Area": "2,235 km²",
        "Continent": "Africa",
        "Timezone": "EAT",
        "Religion": "Islam"
      }
    },
    {
      "name": "Congo (Republic)",
      "flag": "https://flagcdn.com/w320/cg.png",
      "description": "The Republic of Congo, often called Congo-Brazzaville, is a lush rainforest nation where lowland gorillas and forest elephants roam. The Congo River, the world's deepest, powers hydroelectric projects and sustains vibrant riverine cultures. Brazzaville's art deco architecture and lively soukous music scene reflect its cosmopolitan spirit, while Odzala-Kokoua National Park offers pristine wilderness. Oil wealth funds infrastructure, but the country also invests in conservation and eco-tourism, partnering with indigenous communities to protect its biodiversity. Congolese resilience shines through post-conflict recovery and a thriving literary scene.",
      "image": "",
      "gallery": [],
      "details": {
        "Capital": "Brazzaville",
        "Population": "5.5 million",
        "GDP": "$14.6 billion",
        "Currency": "Central African CFA franc (XAF)",
        "Language": "French",
        "Calling Code": "+242",
        "Independence": "1960",
        "President": "Denis Sassou Nguesso",
        "Area": "342,000 km²",
        "Continent": "Africa",
        "Timezone": "WAT",
        "Religion": "Christianity"
      }
    },
    {
      "name": "Congo (DRC)",
      "flag": "https://flagcdn.com/w320/cd.png",
      "description": "The Democratic Republic of Congo is a land of superlatives: home to the world's second-largest rainforest, the mighty Congo River, and rare species like okapis and bonobos. Despite challenges, its cultural vibrancy is undeniable—Kinshasa pulses with rumba music, and Lubumbashi's art scene thrives. The DRC supplies over 60% of the world's cobalt, driving the green energy revolution. Virunga National Park, Africa's oldest, protects mountain gorillas while generating hydroelectric power. Congolese ingenuity shines in bustling markets, innovative tech hubs, and the joyful soukous dance that unites the nation.",
      "image": "",
      "gallery": [],
      "details": {
        "Capital": "Kinshasa",
        "Population": "95 million",
        "GDP": "$64.7 billion",
        "Currency": "Congolese franc (CDF)",
        "Language": "French",
        "Calling Code": "+243",
        "Independence": "1960",
        "President": "Félix Tshisekedi",
        "Area": "2,344,858 km²",
        "Continent": "Africa",
        "Timezone": "WAT/CAT",
        "Religion": "Christianity"
      }
    },
    {
      "name": "Côte d'Ivoire",
      "flag": "https://flagcdn.com/w320/ci.png",
      "description": "Côte d'Ivoire is West Africa's economic powerhouse, where cocoa fields and skyscrapers coexist. Abidjan, the 'Paris of Africa,' dazzles with lagoon-side boulevards and a booming arts scene, while Yamoussoukro's Basilica rivals St. Peter's. The country leads global cocoa production, investing in value-added chocolate processing. Traditional festivals like the Fête du Dipri showcase masked dances, and the Tai Forest shelters endangered chimpanzees. Ivorians take pride in their 'joie de vivre,' expressed through coupé-décalé music and flavorful attiéké dishes. Post-conflict reconciliation has fueled a cultural renaissance and tech startup boom.",
      "image": "",
      "gallery": [],
      "details": {
        "Capital": "Yamoussoukro",
        "Population": "27 million",
        "GDP": "$70.0 billion",
        "Currency": "West African CFA franc (XOF)",
        "Language": "French",
        "Calling Code": "+225",
        "Independence": "1960",
        "President": "Alassane Ouattara",
        "Area": "322,463 km²",
        "Continent": "Africa",
        "Timezone": "GMT",
        "Religion": "Islam, Christianity"
      }
    },
    {
      "name": "Djibouti",
      "flag": "https://flagcdn.com/w320/dj.png",
      "description": "Djibouti is a strategic gateway where the Red Sea meets the Indian Ocean, hosting naval bases from multiple nations. Its otherworldly landscapes—like Lake Assal, Africa's lowest point—attract adventurers, while the Day Forest National Park shelters rare birds. The country leverages its geostrategic position with mega-projects like the Doraleh multipurpose port and Ethiopia-Djibouti railway. Afar and Somali cultures blend in vibrant markets selling aromatic spices, and Lac Ghoubet's volcanic formations create surreal diving spots. Djibouti's vision as a trade and logistics hub is transforming this small nation into a crossroads of continents.",
      "image": "",
      "gallery": [],
      "details": {
        "Capital": "Djibouti",
        "Population": "1 million",
        "GDP": "$3.6 billion",
        "Currency": "Djiboutian franc (DJF)",
        "Language": "French, Arabic",
        "Calling Code": "+253",
        "Independence": "1977",
        "President": "Ismail Omar Guelleh",
        "Area": "23,200 km²",
        "Continent": "Africa",
        "Timezone": "EAT",
        "Religion": "Islam"
      }
    },
    {
      "name": "Egypt",
      "flag": "https://flagcdn.com/w320/eg.png",
      "description": "Egypt is the cradle of civilization, where pharaohs' pyramids meet bustling 21st-century cities. The Nile River, the lifeblood of the nation, sustains ancient farming traditions while Aswan's High Dam powers modern industries. Beyond Giza's iconic Sphinx, Luxor's temples and the Red Sea's coral reefs draw millions. Cairo's Khan el-Khalili bazaar overflows with spices and handicrafts, and the new Administrative Capital showcases Egypt's futuristic ambitions. With a thriving film industry, revolutionary tech startups, and initiatives like the Suez Canal Economic Zone, Egypt balances its glorious past with a dynamic present.",
      "image": "",
      "gallery": [],
      "details": {
        "Capital": "Cairo",
        "Population": "104 million",
        "GDP": "$476.7 billion",
        "Currency": "Egyptian pound (EGP)",
        "Language": "Arabic",
        "Calling Code": "+20",
        "Independence": "1922",
        "President": "Abdel Fattah el-Sisi",
        "Area": "1,010,408 km²",
        "Continent": "Africa",
        "Timezone": "EET",
        "Religion": "Islam"
      }
    },
    {
      "name": "Equatorial Guinea",
      "flag": "https://flagcdn.com/w320/gq.png",
      "description": "Equatorial Guinea is Africa's only Spanish-speaking nation, where rainforests meet oil rigs. Bioko Island's volcanic peaks shelter rare primates, while the mainland's Monte Alén National Park boasts waterfalls and elephants. The capital Malabo's colonial architecture contrasts with gleaming skyscrapers funded by hydrocarbon wealth. Despite inequality challenges, the country invests in education and infrastructure, including the futuristic city of Oyala. Traditional Fang woodcarvings and balele dances persist, and the annual Rio Muni festival celebrates cultural diversity in this often-overlooked corner of Africa.",
      "image": "",
      "gallery": [],
      "details": {
        "Capital": "Malabo",
        "Population": "1.4 million",
        "GDP": "$12.3 billion",
        "Currency": "Central African CFA franc (XAF)",
        "Language": "Spanish, French",
        "Calling Code": "+240",
        "Independence": "1968",
        "President": "Teodoro Obiang Nguema Mbasogo",
        "Area": "28,051 km²",
        "Continent": "Africa",
        "Timezone": "WAT",
        "Religion": "Christianity"
      }
    },
    {
      "name": "Eritrea",
      "flag": "https://flagcdn.com/w320/er.png",
      "description": "Eritrea's Red Sea coastline and Asmara's Italian modernist architecture tell stories of resilience and cultural fusion. The capital, a UNESCO site, boasts art deco cinemas and espresso bars frozen in time. The Dahlak Archipelago's pearl fisheries and coral reefs contrast with the rugged beauty of the Danakil Depression. Eritreans take pride in their independence struggle, channeling that determination into agricultural innovations in the highlands. Though politically isolated, the country preserves rich traditions like Tigrinya poetry and the vibrant melodies of the krar harp, awaiting rediscovery by the world.",
      "image": "",
      "gallery": [],
      "details": {
        "Capital": "Asmara",
        "Population": "6 million",
        "GDP": "$2.1 billion",
        "Currency": "Eritrean nakfa (ERN)",
        "Language": "Tigrinya, Arabic, English",
        "Calling Code": "+291",
        "Independence": "1993",
        "President": "Isaias Afwerki",
        "Area": "117,600 km²",
        "Continent": "Africa",
        "Timezone": "EAT",
        "Religion": "Christianity, Islam"
      }
    },
    {
      "name": "Eswatini",
      "flag": "https://flagcdn.com/w320/sz.png",
      "description": "Eswatini (formerly Swaziland) is a kingdom where tradition and modernity intertwine under the rule of Africa's last absolute monarch. The Umhlanga Reed Dance, a vibrant celebration of womanhood, draws thousands in colorful regalia. Despite HIV challenges, the country leads in conservation with rhino-protection programs and the stunning Mlilwane Wildlife Sanctuary. Swazi crafts—from intricate basket weaving to glassblowing—are world-renowned, and the annual Bushfire Festival unites artists across continents. With fertile valleys producing sugar and citrus, Eswatini blends agricultural heritage with growing manufacturing and tourism sectors.",
      "image": "",
      "gallery": [],
      "details": {
        "Capital": "Mbabane",
        "Population": "1.2 million",
        "GDP": "$4.7 billion",
        "Currency": "Swazi lilangeni (SZL)",
        "Language": "Swazi, English",
        "Calling Code": "+268",
        "Independence": "1968",
        "King": "Mswati III",
        "Area": "17,364 km²",
        "Continent": "Africa",
        "Timezone": "SAST",
        "Religion": "Christianity"
      }
    },
    {
      "name": "Ethiopia",
      "flag": "https://flagcdn.com/w320/et.png",
      "description": "Ethiopia, the 'Cradle of Humankind,' is a land of ancient obelisks, rock-hewn churches, and the source of the Blue Nile. The only African nation never colonized, it boasts a unique calendar and cuisine featuring injera and spicy wat stews. Addis Ababa's African Union headquarters symbolizes pan-African leadership, while Lalibela's underground churches attract pilgrims. The country is racing forward with the Grand Ethiopian Renaissance Dam, tech startups, and a booming airline, yet preserves Oromo horse-jumping ceremonies and Harar's hyena-feeding rituals. Coffee ceremonies remain the heartbeat of Ethiopian hospitality.",
      "image": "",
      "gallery": [],
      "details": {
        "Capital": "Addis Ababa",
        "Population": "120 million",
        "GDP": "$126.8 billion",
        "Currency": "Ethiopian birr (ETB)",
        "Language": "Amharic",
        "Calling Code": "+251",
        "Independence": "Ancient",
        "Prime Minister": "Abiy Ahmed",
        "Area": "1,104,300 km²",
        "Continent": "Africa",
        "Timezone": "EAT",
        "Religion": "Christianity, Islam"
      }
    },
    {
      "name": "Gabon",
      "flag": "https://flagcdn.com/w320/ga.png",
      "description": "Gabon is an eco-paradise where 88% of the land is rainforest, sheltering forest elephants and lowland gorillas. President Ali Bongo's 'Green Gabon' initiative promotes sustainable logging and ecotourism, with 13 national parks like Loango's 'Africa's Last Eden.' Oil wealth funds Libreville's sleek skyscrapers, while villages preserve Bwiti spiritual traditions using the hallucinogenic iboga plant. The country is a biodiversity hotspot with over 8,000 plant species, and its space program monitors deforestation, proving that conservation and development can coexist.",
      "image": "",
      "gallery": [],
      "details": {
        "Capital": "Libreville",
        "Population": "2.3 million",
        "GDP": "$19.3 billion",
        "Currency": "Central African CFA franc (XAF)",
        "Language": "French",
        "Calling Code": "+241",
        "Independence": "1960",
        "President": "Ali Bongo Ondimba",
        "Area": "267,668 km²",
        "Continent": "Africa",
        "Timezone": "WAT",
        "Religion": "Christianity"
      }
    },
    {
      "name": "Gambia",
      "flag": "https://flagcdn.com/w320/gm.png",
      "description": "The Gambia, Africa's smallest mainland country, is a ribbon of land along the Gambia River, known as the 'Smiling Coast' for its warm hospitality. Birdwatchers flock to see 560+ species in the Abuko Nature Reserve, while Kunta Kinteh Island recalls the painful legacy of the slave trade. The country has rebounded from dictatorship through democratic reforms, with women leading in agriculture and politics. Vibrant markets in Banjul sell tie-dye fabrics, and the annual Roots Festival celebrates the return of the African diaspora to this peaceful nation.",
      "image": "",
      "gallery": [],
      "details": {
        "Capital": "Banjul",
        "Population": "2.5 million",
        "GDP": "$2.2 billion",
        "Currency": "Gambian dalasi (GMD)",
        "Language": "English",
        "Calling Code": "+220",
        "Independence": "1965",
        "President": "Adama Barrow",
        "Area": "10,689 km²",
        "Continent": "Africa",
        "Timezone": "GMT",
        "Religion": "Islam"
      }
    },
    {
      "name": "Ghana",
      "flag": "https://flagcdn.com/w320/gh.png",
      "description": "Ghana is West Africa's beacon of stability and progress, where kente cloth weavers and tech entrepreneurs thrive alike. The first sub-Saharan nation to gain independence, it leads in cocoa production and now pioneers digital innovation with mobile money and AI startups. Cape Coast Castle's 'Door of No Return' honors ancestors lost to slavery, while Accra's Makola Market bursts with color and creativity. From the Ashanti Kingdom's golden stools to Afrobeat stars like Sarkodie, Ghanaian culture influences the globe. Eco-friendly resorts along the Gold Coast prove sustainability and luxury can coexist.",
      "image": "",
      "gallery": [],
      "details": {
        "Capital": "Accra",
        "Population": "32 million",
        "GDP": "$77.6 billion",
        "Currency": "Ghanaian cedi (GHS)",
        "Language": "English",
        "Calling Code": "+233",
        "Independence": "1957",
        "President": "Nana Akufo-Addo",
        "Area": "238,533 km²",
        "Continent": "Africa",
        "Timezone": "GMT",
        "Religion": "Christianity, Islam"
      }
    },
    {
      "name": "Guinea",
      "flag": "https://flagcdn.com/w320/gn.png",
      "description": "Guinea's 'water tower of Africa' feeds great rivers like the Niger, powering hydroelectric dams amid lush highlands. The Fouta Djallon's cliffs and the Nimba Mountains' biodiversity are UNESCO-protected, while Conakry's markets pulse with djembe rhythms. Despite political turbulence, the country's bauxite and iron ore riches attract global miners. Guineans preserve ancient Malinke griot storytelling and the fiery soli dancing of the Baga people. Community-led ecotourism projects offer hope for preserving nature and traditions in this resource-rich land.",
      "image": "",
      "gallery": [],
      "details": {
        "Capital": "Conakry",
        "Population": "13 million",
        "GDP": "$21.2 billion",
        "Currency": "Guinean franc (GNF)",
        "Language": "French",
        "Calling Code": "+224",
        "Independence": "1958",
        "President": "Mamady Doumbouya",
        "Area": "245,857 km²",
        "Continent": "Africa",
        "Timezone": "GMT",
        "Religion": "Islam"
      }
    },
    {
      "name": "Guinea-Bissau",
      "flag": "https://flagcdn.com/w320/gw.png",
      "description": "Guinea-Bissau's Bijagós Archipelago is a UNESCO Biosphere Reserve where saltwater hippos and rare sea turtles thrive. This small nation, shaped by Portuguese colonialism and the struggle for independence, channels its spirit into vibrant carnival traditions and gumbe music. Cashew nuts—the 'green gold'—drive the economy, while community tourism showcases animist ceremonies and pristine beaches. Despite political instability, grassroots projects empower women in farming and preserve the unique creole culture of this often-overlooked West African gem.",
      "image": "",
      "gallery": [],
      "details": {
        "Capital": "Bissau",
        "Population": "2 million",
        "GDP": "$1.6 billion",
        "Currency": "West African CFA franc (XOF)",
        "Language": "Portuguese",
        "Calling Code": "+245",
        "Independence": "1973",
        "President": "Umaro Sissoco Embaló",
        "Area": "36,125 km²",
        "Continent": "Africa",
        "Timezone": "GMT",
        "Religion": "Islam, Indigenous beliefs"
      }
    },
    {
      "name": "Kenya",
      "flag": "https://flagcdn.com/w320/ke.png",
      "description": "Kenya is East Africa's powerhouse, where Maasai warriors share savannahs with techpreneurs in Nairobi's 'Silicon Savannah.' The Great Migration in the Maasai Mara dazzles, while Lamu's Swahili stone town whispers centuries of trade history. Kenyan runners dominate global marathons, and the creative economy thrives through Afropop stars like Sauti Sol. Geothermal and solar projects make Kenya a green energy leader, and the M-Pesa mobile payment system revolutionized banking. From Karen Blixen's coffee farms to the turquoise waters of Diani Beach, Kenya blends wild beauty with innovation.",
      "image": "",
      "gallery": [],
      "details": {
        "Capital": "Nairobi",
        "Population": "55 million",
        "GDP": "$113.4 billion",
        "Currency": "Kenyan shilling (KES)",
        "Language": "Swahili, English",
        "Calling Code": "+254",
        "Independence": "1963",
        "President": "William Ruto",
        "Area": "580,367 km²",
        "Continent": "Africa",
        "Timezone": "EAT",
        "Religion": "Christianity, Islam"
      }
    },
    {
      "name": "Lesotho",
      "flag": "https://flagcdn.com/w320/ls.png",
      "description": "Lesotho, the 'Kingdom in the Sky,' is entirely above 1,000 meters, with rugged peaks and traditional Basotho blanket-clad horsemen. The Katse Dam's engineering marvel provides water to South Africa, while community-run lodges in the Maloti Mountains offer pony trekking. Lesotho's constitutional monarchy balances modernity with heritage, and women lead in textile manufacturing. The annual Morija Arts Festival showcases Sesotho culture through dance and crafts, and the dinosaur footprints at Quthing remind visitors of this land's ancient majesty.",
      "image": "",
      "gallery": [],
      "details": {
        "Capital": "Maseru",
        "Population": "2.1 million",
        "GDP": "$2.4 billion",
        "Currency": "Lesotho loti (LSL)",
        "Language": "Sesotho, English",
        "Calling Code": "+266",
        "Independence": "1966",
        "Prime Minister": "Sam Matekane",
        "Area": "30,355 km²",
        "Continent": "Africa",
        "Timezone": "SAST",
        "Religion": "Christianity"
      }
    },
    {
      "name": "Liberia",
      "flag": "https://flagcdn.com/w320/lr.png",
      "description": "Liberia, founded by freed American slaves, is a testament to resilience where rainforests meet Atlantic waves. Africa's first female president, Ellen Johnson Sirleaf, steered post-war recovery, and the country now invests in education and rubber exports. Monrovia's Ducor Hotel symbolizes both faded grandeur and renewal, while Sapo National Park shelters pygmy hippos. Liberian English blends with indigenous languages, and the energetic 'Old Ma' dance reflects cultural pride. Community-led ecotourism and iron ore mining hint at a brighter future for this historic nation.",
      "image": "",
      "gallery": [],
      "details": {
        "Capital": "Monrovia",
        "Population": "5 million",
        "GDP": "$3.5 billion",
        "Currency": "Liberian dollar (LRD)",
        "Language": "English",
        "Calling Code": "+231",
        "Independence": "1847",
        "President": "Joseph Boakai",
        "Area": "111,369 km²",
        "Continent": "Africa",
        "Timezone": "GMT",
        "Religion": "Christianity, Islam"
      }
    },
    {
      "name": "Libya",
      "flag": "https://flagcdn.com/w320/ly.png",
      "description": "Libya's Mediterranean coastline hides Roman ruins like Leptis Magna, some of the best-preserved in the world, while the Sahara's Ubari Lakes glow like turquoise mirages. Once Africa's wealthiest nation by GDP, its oil riches built modern cities like Tripoli, where Ottoman-era souks contrast with Italian colonial architecture. Despite conflict, Libyans preserve Bedouin traditions and the ancient Ghadames 'pearl of the desert' oasis. Reconstruction efforts focus on renewable energy projects, hoping to harness the desert sun for a sustainable future.",
      "image": "",
      "gallery": [],
      "details": {
        "Capital": "Tripoli",
        "Population": "6.8 million",
        "GDP": "$45.8 billion",
        "Currency": "Libyan dinar (LYD)",
        "Language": "Arabic",
        "Calling Code": "+218",
        "Independence": "1951",
        "Head of State": "Mohamed al-Menfi",
        "Area": "1,759,541 km²",
        "Continent": "Africa",
        "Timezone": "EET",
        "Religion": "Islam"
      }
    },
    {
      "name": "Madagascar",
      "flag": "https://flagcdn.com/w320/mg.png",
      "description": "Madagascar, the world's fourth-largest island, is a living evolutionary laboratory where lemurs leap through baobab forests and chameleons shift colors. Isolated for 88 million years, 90% of its wildlife exists nowhere else. The Malagasy blend Austronesian and African roots in traditions like famadihana (bone-turning ceremonies) and vibrant lamba cloth weaving. Vanilla and lychee exports fuel the economy, while community-run reserves like Andasibe protect indris' haunting calls. From Nosy Be's beaches to the Tsingy's stone forests, Madagascar captivates with its otherworldly beauty.",
      "image": "",
      "gallery": [],
      "details": {
        "Capital": "Antananarivo",
        "Population": "28 million",
        "GDP": "$14.9 billion",
        "Currency": "Malagasy ariary (MGA)",
        "Language": "Malagasy, French",
        "Calling Code": "+261",
        "Independence": "1960",
        "President": "Andry Rajoelina",
        "Area": "587,041 km²",
        "Continent": "Africa",
        "Timezone": "EAT",
        "Religion": "Christianity, Indigenous beliefs"
      }
    },
    {
      "name": "Malawi",
      "flag": "https://flagcdn.com/w320/mw.png",
      "description": "Malawi, the 'Warm Heart of Africa,' lives up to its name with legendary hospitality around Lake Malawi's crystal waters—home to 1,000 fish species found nowhere else. Despite poverty, Malawians innovate in farming (pioneer of Africa's first green revolution) and conservation, like Liwonde National Park's elephant translocation success. The annual Lake of Stars festival attracts global artists, while the Gule Wamkulu dance ritual connects communities to ancestral spirits. With new infrastructure projects and a growing tech scene, this landlocked nation is writing a hopeful new chapter.",
      "image": "",
      "gallery": [],
      "details": {
        "Capital": "Lilongwe",
        "Population": "19 million",
        "GDP": "$12.6 billion",
        "Currency": "Malawian kwacha (MWK)",
        "Language": "English, Chichewa",
        "Calling Code": "+265",
        "Independence": "1964",
        "President": "Lazarus Chakwera",
        "Area": "118,484 km²",
        "Continent": "Africa",
        "Timezone": "CAT",
        "Religion": "Christianity"
      }
    },
    {
      "name": "Mali",
      "flag": "https://flagcdn.com/w320/ml.png",
      "description": "Mali's golden age as the heart of the Songhai and Mali empires lives on in Timbuktu's ancient manuscripts and Djenné's awe-inspiring mud-brick mosque. Though facing security challenges, Malians preserve their musical heritage through blues legends like Ali Farka Touré and the Festival au Désert. The Niger River sustains fishing communities and the floating markets of Mopti, while Dogon cliff villages guard astronomical knowledge. Gold mining and solar energy projects offer economic hope, and the resilience of Malian culture continues to inspire the world.",
      "image": "",
      "gallery": [],
      "details": {
        "Capital": "Bamako",
        "Population": "21 million",
        "GDP": "$19.1 billion",
        "Currency": "West African CFA franc (XOF)",
        "Language": "French",
        "Calling Code": "+223",
        "Independence": "1960",
        "President": "Assimi Goïta",
        "Area": "1,240,192 km²",
        "Continent": "Africa",
        "Timezone": "GMT",
        "Religion": "Islam"
      }
    },
    {
      "name": "Mauritania",
      "flag": "https://flagcdn.com/w320/mr.png",
      "description": "Mauritania's endless Sahara dunes meet the Atlantic in Nouadhibou, where shipwrecks litter the 'graveyard coast.' The ancient caravan city of Chinguetti safeguards priceless Quranic libraries, while Banc d'Arguin National Park hosts millions of migratory birds. Iron ore trains—the world's longest—rumble through the desert to fuel the economy. Though slavery's legacy lingers, activists push for reform, and the Haratin community asserts its rights. Traditional Moorish tea ceremonies and Imraguen fishermen's net-casting endure in this crossroads of Arab and African worlds.",
      "image": "",
      "gallery": [],
      "details": {
        "Capital": "Nouakchott",
        "Population": "4.6 million",
        "GDP": "$10.4 billion",
        "Currency": "Mauritanian ouguiya (MRU)",
        "Language": "Arabic",
        "Calling Code": "+222",
        "Independence": "1960",
        "President": "Mohamed Ould Ghazouani",
        "Area": "1,030,700 km²",
        "Continent": "Africa",
        "Timezone": "GMT",
        "Religion": "Islam"
      }
    },
    {
      "name": "Mauritius",
      "flag": "https://flagcdn.com/w320/mu.png",
      "description": "Mauritius is a multicultural paradise where Hindu temples, colonial plantations, and Creole sega music blend on idyllic beaches. Once reliant on sugar, it's now Africa's most competitive economy, with thriving textile, tourism, and offshore banking sectors. The dodo's legacy fuels conservation efforts protecting endemic species like the pink pigeon. Port Louis' Chinatown and Aapravasi Ghat's UNESCO-listed immigration depot tell stories of indentured laborers who shaped the island. From luxury resorts to the Seven-Colored Earths, Mauritius proves small islands can achieve big dreams.",
      "image": "",
      "gallery": [],
      "details": {
        "Capital": "Port Louis",
        "Population": "1.3 million",
        "GDP": "$14.8 billion",
        "Currency": "Mauritian rupee (MUR)",
        "Language": "English, French, Creole",
        "Calling Code": "+230",
        "Independence": "1968",
        "Prime Minister": "Pravind Jugnauth",
        "Area": "2,040 km²",
        "Continent": "Africa",
        "Timezone": "MUT",
        "Religion": "Hinduism, Christianity, Islam"
      }
    },
    {
      "name": "Morocco",
      "flag": "https://flagcdn.com/w320/ma.png",
      "description": "Morocco dazzles with Atlas Mountain peaks, Sahara dunes, and the blue-washed alleys of Chefchaouen. Marrakech's medina thrums with snake charmers and spice-scented souks, while Casablanca's Hassan II Mosque towers over the Atlantic. High-speed trains link ancient cities as the country positions itself as Africa's gateway to Europe. Berber traditions thrive in the Ourika Valley's rug-weaving cooperatives, and sustainable argan oil production empowers rural women. From Hollywood-filmed Ouarzazate to the Gnaoua World Music Festival, Morocco weaves magic from mountains to sea.",
      "image": "",
      "gallery": [],
      "details": {
        "Capital": "Rabat",
        "Population": "37 million",
        "GDP": "$142.9 billion",
        "Currency": "Moroccan dirham (MAD)",
        "Language": "Arabic, Berber",
        "Calling Code": "+212",
        "Independence": "1956",
        "King": "Mohammed VI",
        "Area": "446,550 km²",
        "Continent": "Africa",
        "Timezone": "WET",
        "Religion": "Islam"
      }
    },
    {
      "name": "Mozambique",
      "flag": "https://flagcdn.com/w320/mz.png",
      "description": "Mozambique's 2,500km Indian Ocean coastline sparkles with the Bazaruto Archipelago's coral reefs and Quirimbas' dhow-sailed waters. Recovering from civil war, it's now a gas-exporting powerhouse investing in education and women's leadership. Maputo's art deco buildings and vibrant marrabenta music scene contrast with Ilha de Moçambique's Swahili-Portuguese history. Gorongosa National Park's wildlife revival symbolizes national resilience, while the annual Festival dos Reis celebrates the fusion of African and Portuguese cultures in this Lusophone gem.",
      "image": "",
      "gallery": [],
      "details": {
        "Capital": "Maputo",
        "Population": "32 million",
        "GDP": "$17.9 billion",
        "Currency": "Mozambican metical (MZN)",
        "Language": "Portuguese",
        "Calling Code": "+258",
        "Independence": "1975",
        "President": "Filipe Nyusi",
        "Area": "801,590 km²",
        "Continent": "Africa",
        "Timezone": "CAT",
        "Religion": "Christianity, Islam"
      }
    },
    {
      "name": "Namibia",
      "flag": "https://flagcdn.com/w320/na.png",
      "description": "Namibia's surreal landscapes—from the rust-red dunes of Sossusvlei to the shipwreck-strewn Skeleton Coast—feel like another planet. Africa's second-least densely populated country pioneers community conservancies, where Himba herders and desert-adapted elephants coexist. Windhoek's German colonial legacy meets avant-garde architecture, while Swakopmund offers adrenaline-fueled dune boarding. Namibia's progressive constitution empowers women, and its marine reserves protect seals and dolphins. Stargazers revel in some of Earth's darkest skies at the NamibRand Nature Reserve.",
      "image": "",
      "gallery": [],
      "details": {
        "Capital": "Windhoek",
        "Population": "2.5 million",
        "GDP": "$12.6 billion",
        "Currency": "Namibian dollar (NAD)",
        "Language": "English",
        "Calling Code": "+264",
        "Independence": "1990",
        "President": "Nangolo Mbumba",
        "Area": "825,615 km²",
        "Continent": "Africa",
        "Timezone": "CAT",
        "Religion": "Christianity"
      }
    }
  ,
  
    {
      "name": "Niger",
      "flag": "https://flagcdn.com/w320/ne.png",
      "description": "Niger, the gateway between North and Sub-Saharan Africa, is defined by the Sahara's expanse and the life-giving Niger River. The ancient trans-Saharan trade lives on in Agadez's mud-brick mosque and Tuareg camel caravans. Despite being one of the world's hottest countries, Niger invests in solar energy and uranium mining while preserving W National Park's giraffes and lions. The annual Cure Salée festival brings nomadic tribes together for camel races and cultural exchange. Nigeriens demonstrate remarkable resilience through droughts, with women leading reforestation projects and artisan cooperatives.",
      "image": "",
      "gallery": [],
      "details": {
        "Capital": "Niamey",
        "Population": "25 million",
        "GDP": "$15.3 billion",
        "Currency": "West African CFA franc (XOF)",
        "Language": "French",
        "Calling Code": "+227",
        "Independence": "1960",
        "President": "Mohamed Bazoum",
        "Area": "1,267,000 km²",
        "Continent": "Africa",
        "Timezone": "WAT",
        "Religion": "Islam"
      }
    },
    {
      "name": "Nigeria",
      "flag": "https://flagcdn.com/w320/ng.png",
      "description": "Nigeria, Africa's most populous nation and largest economy, is a cultural powerhouse where Nollywood films, Afrobeat music (pioneered by Fela Kuti), and literary giants like Chimamanda Ngozi Adichie shape global trends. Lagos, its bustling commercial hub, mixes tech startups with vibrant street food scenes, while the northern city of Kano preserves centuries-old dye pits and Islamic scholarship. Oil wealth fuels infrastructure projects, but agriculture and creative industries drive diversification. From the Yoruba kingdoms' bronze art to Calabar's carnival, Nigeria's dynamism is as vast as the Niger Delta's waterways.",
      "image": "",
      "gallery": [],
      "details": {
        "Capital": "Abuja",
        "Population": "223 million",
        "GDP": "$477.4 billion",
        "Currency": "Naira (NGN)",
        "Language": "English",
        "Calling Code": "+234",
        "Independence": "1960",
        "President": "Bola Tinubu",
        "Area": "923,768 km²",
        "Continent": "Africa",
        "Timezone": "WAT",
        "Religion": "Islam, Christianity"
      }
    },
    {
      "name": "Rwanda",
      "flag": "https://flagcdn.com/w320/rw.png",
      "description": "Rwanda, the 'Land of a Thousand Hills,' has transformed from tragedy into one of Africa's cleanest and most innovative nations. Kigali's tech hubs and women-led parliament (61% female) contrast with Volcanoes National Park's mountain gorillas—immortalized by Dian Fossey. The annual Kwita Izina gorilla-naming ceremony celebrates conservation wins, while Umuganda community service days foster unity. Rwanda's coffee and tea exports fuel an economy embracing renewable energy and drone technology. Traditional Intore dancers and genocide memorials alike testify to the nation's remarkable resilience.",
      "image": "",
      "gallery": [],
      "details": {
        "Capital": "Kigali",
        "Population": "13.5 million",
        "GDP": "$13.3 billion",
        "Currency": "Rwandan franc (RWF)",
        "Language": "Kinyarwanda, French, English",
        "Calling Code": "+250",
        "Independence": "1962",
        "President": "Paul Kagame",
        "Area": "26,338 km²",
        "Continent": "Africa",
        "Timezone": "CAT",
        "Religion": "Christianity"
      }
    },
    {
      "name": "São Tomé and Príncipe",
      "flag": "https://flagcdn.com/w320/st.png",
      "description": "São Tomé and Príncipe, Africa's second-smallest country, is a tropical Eden where cocoa plantations meet volcanic beaches. These 'Chocolate Islands' produce premium organic cocoa, while Obo National Park's rainforests shelter endemic birds like the São Tomé ibis. Portuguese colonial architecture blends with the rhythms of ússua and socopé music. Offshore oil discoveries promise economic transformation, but the nation prioritizes sustainable tourism—whether hiking Pico Cão Grande's needle-like peak or spotting whales between the two islands. A model of political stability, it's a hidden gem for eco-travelers.",
      "image": "",
      "gallery": [],
      "details": {
        "Capital": "São Tomé",
        "Population": "220,000",
        "GDP": "$547 million",
        "Currency": "Dobra (STN)",
        "Language": "Portuguese",
        "Calling Code": "+239",
        "Independence": "1975",
        "President": "Carlos Vila Nova",
        "Area": "964 km²",
        "Continent": "Africa",
        "Timezone": "GMT",
        "Religion": "Christianity"
      }
    },
    {
      "name": "Senegal",
      "flag": "https://flagcdn.com/w320/sn.png",
      "description": "Senegal, the westernmost point of Africa, dazzles with Dakar's vibrant arts scene, pink lakes, and the UNESCO-listed Gorée Island—a poignant reminder of the slave trade. The country blends Wolof traditions with French flair, seen in Saint-Louis' jazz festival and Thiéboudienne (national fish-and-rice dish). As a democratic leader in West Africa, it hosts the African Renaissance Monument and invests in infrastructure like the new Blaise Diagne Airport. Surfers ride waves at N'Gor, while the sacred baobabs of the Sine-Saloum Delta reveal Senegal's spiritual heart.",
      "image": "",
      "gallery": [],
      "details": {
        "Capital": "Dakar",
        "Population": "17 million",
        "GDP": "$27.7 billion",
        "Currency": "West African CFA franc (XOF)",
        "Language": "French",
        "Calling Code": "+221",
        "Independence": "1960",
        "President": "Macky Sall",
        "Area": "196,722 km²",
        "Continent": "Africa",
        "Timezone": "GMT",
        "Religion": "Islam"
      }
    },
    {
      "name": "Seychelles",
      "flag": "https://flagcdn.com/w320/sc.png",
      "description": "Seychelles, an Indian Ocean archipelago of 115 islands, is a paradise of granite boulders and coral atolls. The world's smallest capital, Victoria, charms with Creole architecture and giant tortoises, while Aldabra Atoll's UNESCO-listed ecosystem shelters 150,000 tortoises. Pioneers in sustainable tourism, Seychelles protects 30% of its waters and runs carbon-neutral resorts. The fusion of African, Asian, and European influences creates unique moutya drumming and coconut curries. With the highest GDP per capita in Africa, it's a model of eco-luxury and biodiversity conservation.",
      "image": "",
      "gallery": [],
      "details": {
        "Capital": "Victoria",
        "Population": "99,000",
        "GDP": "$2.0 billion",
        "Currency": "Seychellois rupee (SCR)",
        "Language": "Seychellois Creole, English, French",
        "Calling Code": "+248",
        "Independence": "1976",
        "President": "Wavel Ramkalawan",
        "Area": "452 km²",
        "Continent": "Africa",
        "Timezone": "SCT",
        "Religion": "Christianity"
      }
    },
    {
      "name": "Sierra Leone",
      "flag": "https://flagcdn.com/w320/sl.png",
      "description": "Sierra Leone, whose name means 'Lion Mountains,' is rebounding from civil war and Ebola with stunning beaches and resilient communities. Freetown's Cotton Tree symbolizes freedom for formerly enslaved settlers, while Bunce Island preserves slave-trade history. The Tacugama Chimpanzee Sanctuary protects endangered primates, and diamond mines now fund education instead of conflict. Bureh Beach surfers ride Atlantic waves, and the annual Roots Homecoming Festival celebrates the diaspora's return. With women leading peacebuilding and iron ore exports growing, Sierra Leoneans write a hopeful new chapter.",
      "image": "",
      "gallery": [],
      "details": {
        "Capital": "Freetown",
        "Population": "8.4 million",
        "GDP": "$4.2 billion",
        "Currency": "Leone (SLL)",
        "Language": "English",
        "Calling Code": "+232",
        "Independence": "1961",
        "President": "Julius Maada Bio",
        "Area": "71,740 km²",
        "Continent": "Africa",
        "Timezone": "GMT",
        "Religion": "Islam, Christianity"
      }
    },
    {
      "name": "Somalia",
      "flag": "https://flagcdn.com/w320/so.png",
      "description": "Somalia, the Horn of Africa's cultural heartland, is slowly rebuilding after decades of conflict. Mogadishu's Ottoman-era mosques and Italian colonial buildings hint at its cosmopolitan past, while the ancient port of Berbera revives trade links. Somali poetry and the oud's melancholic melodies remain vital cultural expressions, and camel herding sustains nomadic traditions. The federal government now partners with tech startups to improve services, and the diaspora invests in businesses. With the continent's longest coastline, Somalia's future lies in fishing, frankincense, and reconnecting with its maritime heritage.",
      "image": "",
      "gallery": [],
      "details": {
        "Capital": "Mogadishu",
        "Population": "17 million",
        "GDP": "$7.5 billion",
        "Currency": "Somali shilling (SOS)",
        "Language": "Somali, Arabic",
        "Calling Code": "+252",
        "Independence": "1960",
        "President": "Hassan Sheikh Mohamud",
        "Area": "637,657 km²",
        "Continent": "Africa",
        "Timezone": "EAT",
        "Religion": "Islam"
      }
    },
    {
      "name": "South Africa",
      "flag": "https://flagcdn.com/w320/za.png",
      "description": "South Africa, the 'Rainbow Nation,' dazzles with Table Mountain's vistas, Kruger's Big Five, and Cape Winelands' vineyards. Johannesburg's Apartheid Museum and Soweto's Vilakazi Street (home to two Nobel winners) testify to its complex history. Africa's most industrialized economy leads in renewable energy and hosts Silicon Cape's tech innovators. From Zulu beadwork to Cape Malay cuisine, cultural diversity thrives alongside wildlife conservation. The annual Durban July horse race and Afropunk festival showcase South Africa's vibrant fusion of tradition and modernity.",
      "image": "",
      "gallery": [],
      "details": {
        "Capital": "Pretoria (executive)",
        "Population": "60 million",
        "GDP": "$405.9 billion",
        "Currency": "Rand (ZAR)",
        "Language": "11 official (Zulu, Xhosa, Afrikaans, English etc.)",
        "Calling Code": "+27",
        "Independence": "1910 (from UK)",
        "President": "Cyril Ramaphosa",
        "Area": "1,221,037 km²",
        "Continent": "Africa",
        "Timezone": "SAST",
        "Religion": "Christianity"
      }
    },
    {
      "name": "South Sudan",
      "flag": "https://flagcdn.com/w320/ss.png",
      "description": "South Sudan, the world's youngest nation, is defined by the Nile's lifeline and the resilience of its diverse ethnic groups. The Sudd, Africa's largest wetland, sustains pastoralists and rare shoebill storks. Despite conflict, communities preserve vibrant traditions like Dinka cattle camps and Mundari scarification rituals. Oil reserves offer economic potential, while conservationists protect migrating antelope herds in Boma National Park. The capital Juba's bustling markets and new universities symbolize hope for stability and development in this resource-rich land.",
      "image": "",
      "gallery": [],
      "details": {
        "Capital": "Juba",
        "Population": "11 million",
        "GDP": "$6.0 billion",
        "Currency": "South Sudanese pound (SSP)",
        "Language": "English",
        "Calling Code": "+211",
        "Independence": "2011",
        "President": "Salva Kiir Mayardit",
        "Area": "644,329 km²",
        "Continent": "Africa",
        "Timezone": "CAT",
        "Religion": "Christianity, Indigenous beliefs"
      }
    },
    {
      "name": "Sudan",
      "flag": "https://flagcdn.com/w320/sd.png",
      "description": "Sudan, where the Blue and White Niles merge, is a crossroads of Arab and African cultures. Ancient Nubian pyramids at Meroë stand testament to the Kingdom of Kush, while Khartoum's souks brim with spices and gold. The Red Sea coast offers pristine diving, and Dinder National Park shelters rare birds. Though facing political transitions, Sudanese preserve rich traditions like zar spirit ceremonies and intricate toub (traditional dress) weaving. Agricultural projects along the Nile and gum arabic exports hint at economic revival potential.",
      "image": "",
      "gallery": [],
      "details": {
        "Capital": "Khartoum",
        "Population": "46 million",
        "GDP": "$34.3 billion",
        "Currency": "Sudanese pound (SDG)",
        "Language": "Arabic, English",
        "Calling Code": "+249",
        "Independence": "1956",
        "Head of State": "Abdel Fattah al-Burhan",
        "Area": "1,861,484 km²",
        "Continent": "Africa",
        "Timezone": "CAT",
        "Religion": "Islam"
      }
    },
    {
      "name": "Tanzania",
      "flag": "https://flagcdn.com/w320/tz.png",
      "description": "Tanzania is East Africa's natural wonderland, home to Kilimanjaro's snow-capped peak, the Serengeti's Great Migration, and Zanzibar's spice-scented beaches. Over 120 ethnic groups coexist peacefully, with Swahili serving as the lingua franca. Dar es Salaam's skyline rises alongside historic Stone Town, while Ngorongoro Crater teems with wildlife. The country balances conservation (38% of land protected) with strategic investments in ports and railways. From Maasai bomas to Tingatinga paintings, Tanzania's cultural tapestry is as vibrant as its coral reefs.",
      "image": "",
      "gallery": [],
      "details": {
        "Capital": "Dodoma",
        "Population": "63 million",
        "GDP": "$84.0 billion",
        "Currency": "Tanzanian shilling (TZS)",
        "Language": "Swahili, English",
        "Calling Code": "+255",
        "Independence": "1961",
        "President": "Samia Suluhu Hassan",
        "Area": "945,087 km²",
        "Continent": "Africa",
        "Timezone": "EAT",
        "Religion": "Christianity, Islam"
      }
    },
    {
      "name": "Togo",
      "flag": "https://flagcdn.com/w320/tg.png",
      "description": "Togo, a sliver of West Africa, packs diverse landscapes from palm-fringed beaches to the rolling Kpalimé coffee hills. Lomé's Grand Marché dazzles with vibrant wax prints and voodoo fetishes, while Togoville's stilt villages preserve ancient traditions. The country is a regional leader in gender equality, with women dominating cross-border trade. Eco-tourism thrives in Fazao-Malfakassa National Park, and phosphate exports fund infrastructure. From Ewe drumming rhythms to the Guinness-listed Fête des Tabaski, Togo celebrates its cultural mosaic with pride.",
      "image": "",
      "gallery": [],
      "details": {
        "Capital": "Lomé",
        "Population": "8.5 million",
        "GDP": "$8.5 billion",
        "Currency": "West African CFA franc (XOF)",
        "Language": "French",
        "Calling Code": "+228",
        "Independence": "1960",
        "President": "Faure Gnassingbé",
        "Area": "56,785 km²",
        "Continent": "Africa",
        "Timezone": "GMT",
        "Religion": "Christianity, Islam, Voodoo"
      }
    },
    {
      "name": "Tunisia",
      "flag": "https://flagcdn.com/w320/tn.png",
      "description": "Tunisia, birthplace of the Arab Spring, blends Mediterranean charm with Saharan adventure. Carthage's Roman ruins overlook the blue-and-white village of Sidi Bou Said, while the El Jem amphitheater rivals Rome's. The Sahara's golden dunes meet Star Wars film sets in Tataouine. Tunisians take pride in their progressive personal status code empowering women, and the ancient medina of Tunis buzzes with artisan workshops. Olive oil and phosphate exports drive the economy, while new constitutional reforms aim to strengthen democracy in this North African trailblazer.",
      "image": "",
      "gallery": [],
      "details": {
        "Capital": "Tunis",
        "Population": "12 million",
        "GDP": "$46.7 billion",
        "Currency": "Tunisian dinar (TND)",
        "Language": "Arabic",
        "Calling Code": "+216",
        "Independence": "1956",
        "President": "Kais Saied",
        "Area": "163,610 km²",
        "Continent": "Africa",
        "Timezone": "CET",
        "Religion": "Islam"
      }
    },
    {
      "name": "Uganda",
      "flag": "https://flagcdn.com/w320/ug.png",
      "description": "Uganda, the 'Pearl of Africa,' dazzles with mountain gorillas in Bwindi, the Nile's thunderous Murchison Falls, and Lake Victoria's islands. Kampala's vibrant nightlife and entrepreneurial boda-boda (motorcycle taxi) drivers contrast with the serene Buganda Kingdom's royal drums. The world's youngest population drives innovation in mobile banking and agriculture, while conservationists protect chimpanzees in Kibale Forest. From the Rwenzori Mountains' glaciers to Ankole cattle's majestic horns, Uganda's natural and cultural wealth is unmatched.",
      "image": "",
      "gallery": [],
      "details": {
        "Capital": "Kampala",
        "Population": "47 million",
        "GDP": "$48.0 billion",
        "Currency": "Ugandan shilling (UGX)",
        "Language": "English, Swahili",
        "Calling Code": "+256",
        "Independence": "1962",
        "President": "Yoweri Museveni",
        "Area": "241,038 km²",
        "Continent": "Africa",
        "Timezone": "EAT",
        "Religion": "Christianity, Islam"
      }
    },
    {
      "name": "Zambia",
      "flag": "https://flagcdn.com/w320/zm.png",
      "description": "Zambia, the adventure capital of Africa, thrills with Victoria Falls' misty roar and walking safaris in South Luangwa. Copper mining built cities like Ndola, but now eco-lodges and community tourism thrive in Kafue National Park. The vibrant Kuomboka ceremony sees the Lozi king move to higher ground by barge, while Lusaka's bustling markets showcase Tonga baskets and Nshima (maize staple) cuisine. With hydropower potential from the Zambezi and a youthful tech-savvy population, Zambia balances resource wealth with sustainable development.",
      "image": "",
      "gallery": [],
      "details": {
        "Capital": "Lusaka",
        "Population": "19 million",
        "GDP": "$29.2 billion",
        "Currency": "Zambian kwacha (ZMW)",
        "Language": "English",
        "Calling Code": "+260",
        "Independence": "1964",
        "President": "Hakainde Hichilema",
        "Area": "752,618 km²",
        "Continent": "Africa",
        "Timezone": "CAT",
        "Religion": "Christianity"
      }
    },
    {
      "name": "Zimbabwe",
      "flag": "https://flagcdn.com/w320/zw.png",
      "description": "Zimbabwe, home to the Great Zimbabwe ruins and Victoria Falls, is a land of stone-carved history and breathtaking landscapes. Harare's vibrant arts scene contrasts with Matobo Hills' ancient rock paintings and rhino sanctuaries. Despite economic challenges, Zimbabweans preserve Shona sculpture traditions and mbira music's spiritual melodies. Conservation success stories include Hwange's elephants and Gonarezhou's painted dogs. With fertile soils and educated diaspora returning, the country taps into tobacco farming and renewable energy for a brighter future.",
      "image": "",
      "gallery": [],
      "details": {
        "Capital": "Harare",
        "Population": "15 million",
        "GDP": "$28.4 billion",
        "Currency": "Zimbabwean dollar (ZWL)",
        "Language": "English, Shona, Ndebele",
        "Calling Code": "+263",
        "Independence": "1980",
        "President": "Emmerson Mnangagwa",
        "Area": "390,757 km²",
        "Continent": "Africa",
        "Timezone": "CAT",
        "Religion": "Christianity"
      }
    }
  ]